
const Career1 = () => {
  return (
    <div>
      <h1>아르바이트</h1>
      <fieldset>
        <legend>아르바이트를 했던 경험과 그걸 통해 얻은 것</legend>
        <h>[평범한 아르바이트생에서 신뢰있는 동료가 되기까지]</h>
        <p>
          저는 과거 이마트 캐셔 부서에서 1년 동안 아르바이트를 한 경험이 있습니다.<br/>
          제가 처음 일을 시작하고 첫 분기에 캐셔 부서의 서비스 만족도 조사에서 타 지점 평균 대비 약 -17%라는 수치가 나온 적이 있었습니다.<br/>
          그래서 저는 서비스에 집중하기 위해 문제점이 무엇인지 생각하였습니다. 고객의 불만은 대부분 상품 바코드에 오류가 발생하거나 훼손된 바코드로 인해 스캔이
          되지 않아 계산 처리에 시간이 많이 소요되는 점에 있었습니다.<br/>
          저는 고객 만족도를 높이기 위해 오류가 생긴 바코드들이 있으면 사내 앱을 이용하여 보고하여 조치를 할 수 있도록 하였습니다.<br/>
          그리고 바코드가 쉽게 훼손되는 상품들을 기억하여 상품들의 문제 없는 바코드 사진을 촬영하고 공유하여 사용하자는 의견을 내고 실행하였습니다.
          또한 고객의 다양한 문의와 요구사항에 항상 친절하게 대응하였습니다. 
          그렇게 바코드 훼손 문제가 생길 때마다 다시 멀쩡한 바코드를 찾으러 갈 필요 없이 촬영한
          사진을 스캔하고 신속한 서비스를 제공하여 고객의 불만을 최소화하는데 기여하였고, 다음 분기의 서비스 만족도 조사에선 +12%라는 결과를 얻을 수 있었습니다.
          이러한 의견 개진과 저의 실행력을 통하여 파트장님을 비롯한 다른 파트너님들께 저에 대한 신뢰를 쌓을 수 있었고, 그 결과 단순한 아르바이트생으로서
          계약 관계에 그치지 않고 함께 일하는 동료로서 계속 찾고 좋아해주는 그런 사람이 될 수 있었습니다.
          이런 경험을 통해서 저는 사람과 사람 사이에 중요한 것은 신뢰라는 것을 배우게 되었습니다.<br/>
          일을 한다는 것은 단순히 업무에만 집중하는 것이 아닌 동료들과 서로 의지하고 관계를 만들며 이루어지는 것으로 생각합니다.
          <br/>
          저는 이처럼 넥슨 게임의 동료, 파트너와 신뢰를 바탕으로 오랫동안 함께 하고 싶은 “좋은 사람”이 되겠습니다
          <br/>
          감사합니다.
        </p>
      </fieldset>

    </div>
  );
};

export default Career1;