import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
      <table>
        <div class ="division">
          <fieldset>
          <legend>넥슨게임에 지원하게 된 계기는 무엇인가요? 입사를 하게 된다면, 5년 이내에 이루고 싶은 목표(비전)와 이를 이루기 위한 계획에 대하여 구체적으로 작성해주세요.</legend>
          <h>[게임을 좋아하고 함께한 나의 이야기]</h>
          <p>
            저와 게임의 인연이 처음 시작된 것은, 다섯 살 때 생일선물로 받은 플레이스테이션2로 즐긴 '타임 크라이시스 2'였습니다. 게임을 하면서 제가 직접 총을 쏘는 것 같은 기분에 정말 재미있었던 기억이 납니다. 초등학교를 입학하고 친구들을 사귀고 함께 즐기는 게임들을 찾아 모바일 게임과 PC게임에도 발을 들이게 되었고, 이 과정에서 다양한 플랫폼과 여러 장르의 게임을 경험하였습니다.<br/>
            그러다 중학교 1학년 때 친구와 저는 RPG Maker로 간단한 게임을 만들어 보기로 하였습니다. 비록 게임을 완성하지는 못했지만, 수업 시간이나 쉬는 시간뿐만 아니라 밤늦게까지 친구와 함께 있으며 게임 속 캐릭터나 줄거리 등 게임 내 요소에 대해 구상하였고, 그것들을 구현하려 했을 때 게임을 플레이하는 것과는 다른 색다른 재미를 느꼈고 그때부터 게임과 관련된 일에 관심을 갖게 되었습니다.<br/><br/>
            고등학생 때 호기심이 많던 저는 게임을 즐길 때 게임 내에 있는 맵은 어디까지 구현되어 있고 직접 가볼 수 있는지, 이야기를 풀어가기 위해 주어지는 쪽지나 아이템, NPC 등 게임을 구성하는 여러 요소에 집중하였습니다. 이런 플레이 방식으로, 게임을 자세히 들여다보고 꼼꼼히 플레이하는 습관을 들이게 되었습니다. 이런 과정에서 게임을 만들 때 생각보다 작은 디테일에도 신경 써야 할 것이 많다는 것을 알게 되었습니다. 그래서 게임에 새로운 요소들을 추가하거나 수정할 때 발생하는 결함을 어떻게 발견하고 조처를 하는지 알고 싶었습니다. 이런 게임에 대한 저의 경험과 호기심은 게임에 대한 열정을 더욱 불타오르게 했고, 게임 제작에 관한 관심이 직업으로 삼고 싶다는 마음가짐으로 바뀌었습니다.
          </p>
          <h>[게임은 재미있어야 한다]</h>
          <p>
          저는 과거부터 현재까지 게임을 즐기며 생각했던 것은 게임은 재미있어야 한다는 것입니다. 저는 한때 FPS 게임만 골라서 플레이했던 적이 있었고, RPG 게임만을 골라서 했던 적이 있습니다. 이렇게 특정 장르만 선호했던 제가 여러 장르를 즐기게 되었던 것은 바로 재미있는 게임을 찾아서 플레이했기 때문입니다. 재미있는 게임은 장르를 불문하고 많은 유저에게 새로운 즐거움과 경험을 선사한다는 것을 알게 되었습니다.<br/>
          이런 제 생각은 더 좋은 게임을 만들고 세상에 보여주고 싶은 넥슨 게임의 비전과도 부합한다고 생각하였습니다. 그렇기 때문에 넥슨 게임과 함께하고 싶은 마음이 가장 컸습니다. 그리고 제가 많이 경험해보지 못한 영역에 대한 도전을 해보고 싶었습니다.<br/><br/>
          제가 게임 제작 업무에 합류하게 된다면 실제 유저의 입장에서 생각하고, 소프트웨어 품질 향상을 위해 필요한 역량을 키워 제작 영역에서 발전하는 모습을 보여드리고 싶습니다. 이를 통해서 많은 유저에게 제가 게임을 할 때 느꼈었던 재미와 감동을 하게 하고 싶습니다. 저는 게임을 해본 사람이라면 넥슨 게임을 한 번쯤은 해봤다고 생각합니다. 이 과정에서 혼자서 즐겼을 수도 있고, 누군가와 함께 즐겼을 수도 있습니다. 한 사람이 게임을 어떻게 즐겼든 간에 넥슨 게임을 하는 동안 만큼은 힘든 일이나 스트레스를 잊고 정말 재미있고 즐겁게 시간을 보낼 수 있는 그런 소중한 추억을 심어주는 게임을 만들고 싶습니다.
          </p>
          </fieldset>
        </div>
      </table>
      
      <table>
        <div class ="division">
          <fieldset>
            <legend>게임 제작을 잘하기 위해 필요한 역량을 근거로, 지원 직무에 대한 본인의 강점/역량을 구체적으로 작성해주세요. 추가로 어필하고 싶은 능력이 있다면 함께 작성해 주세요. (외국어, 프로그래밍 경험, 데이터 활용, 커뮤니케이션 등)</legend>
            <p>
            저는 상술했듯이 게임을 여러 하드웨어를 통해서 깊게 즐겨보았고, 게임을 직접 제작해본 경험까지 있습니다. 그리고 제 전공인 컴퓨터공학과에서 전공 공부를 하며 프로그래밍했던 경험도 있습니다. 이 과정에서 "소프트웨어공학"이라는 과목에서 게임 테스트에 필요한 품질 보증과 소프트웨어 테스트에 관한 지식을 습득하기도 하였습니다. 이런 저의 풍부한 게임 경험과 전공 지식을 활용하여 제작 업무를 수행하는데 수월할 뿐만 아니라 게임 제작에 참여하는 프로그래밍, 기획팀 등등 다른 팀원분들과 협업할 때 의사소통을 원활하게 할 수 있는 점이 강점이라고 생각합니다.<br/><br/>
            다음으로는 저의 커뮤니케이션 능력이라고 할 수 있습니다. 저는 일을 할 때 업무에만 집중하는 것이 아니라 동료들과 여러 상호작용을 통해서 이루어지는 것으로 생각했습니다. 게다가 저는 사람들의 이야기를 듣는 것을 좋아하고 저는 처음 보는 사람들과 좀 더 가까워지기 위해 대화하는 것을 즐깁니다. 저의 커뮤니케이션 능력은 동료들과 협력하여 업무를 수행하는 데에도 큰 도움을 줄 것으로 생각합니다.<br/><br/>
            저는 매년 발전하는 게임 추세나 정보를 얻을 때 필요한 영어 공부도 틈틈이 했습니다. 언제든 필요할 때 해외 사이트를 통해 정보를 얻고 활용할 때 필요한 역량이라고 생각했기 때문입니다. 이를 통해 새로운 기술과 지식을 쉽게 파악하고 적용할 줄 아는 사람이 되겠습니다.
            </p>
          </fieldset>
        </div>
      </table>
      
      <table>
        <div class ="division">
          <fieldset>
            <legend>나와 다른 성향과 생각을 가진 사람과 함께 협업하며, 공동의 목표를 달성한 경험을 서술해 주세요.</legend>
            <h>[적극적 커뮤니케이션 능력을 갖춘 사람]</h>
            <p>
            저는 외향적인 성격으로 다른 사람들과 대화하고 여러 상호 작용을 통해 관계를 형성하는 것을 좋아합니다. 그리고 누군가와 일을 할 때도 의사소통이 가장 중요하다고 생각합니다. 저의 이런 성격을 바탕으로 좋은 성과를 내었던 경험이 있습니다.<br/><br/>
            대학교에서 조별 과제를 수행하던 중 저희 조의 몇몇 조원이 내향적인 성격이어서 소통이 잘되지 않았었습니다. 그래서 각자 역할 분담을 하는 데 어려움이 있었고 서로가 맡은 바를 정확히 알지 못해 자료를 취합하거나 발표 자료를 제작할 때 어려움이 있었습니다. 그 결과 과제 중간 점검 때 10개 조 중 9위라는 아쉬운 평가를 받았습니다. 이대로는 안 되겠다 싶어 조에서 저는 조장님에게 조원들끼리 친해지는 시간을 갖자는 의견을 제시하였고, 저희 둘은 과제 모임이 아닌 친목 모임을 주도하여 서로 간 어색한 분위기를 풀어가며 활발한 의사소통을 할 수 있도록 하였습니다. 이를 바탕으로 각자가 맡은 일을 확실하게 분담하였고, 이틀마다 맡은 일의 진행도를 공유하고 피드백하여 발표 자료의 퀄리티를 높였습니다. 발전한 팀워크를 보여준 저희 조는 최종 평가 때 2위라는 우수한 평가를 받았고, 그 수업의 좋은 성적을 받았던 경험이 있었습니다.<br/><br/>
            당시 저는 조원들과 친해지기 위해 끊임없이 대화를 시도했습니다. 그리고 피드백을 주고받을 때에도 솔직하게 의견을 나누자고 했습니다. 이는 한 학기 동안의 꾸준한 노력과 팀워크를 위한 저의 집요함이 만들어낸 결과라고 생각합니다. 저는 제작 업무에 있어서도 이러한 집요함과 팀워크를 위한 뛰어난 커뮤니케이션 능력은 매우 중요하다고 생각합니다. 게임 제작은 혼자서 하는 일이 아닌 기획자, 아티스트, 프로그래머, 시험 담당자 등 여러 사람의 팀워크와 노력이 필요한 분야이기 때문입니다.<br/><br/>
            저는 협업을 통하여 동료들과의 긍정적인 상호작용과 아이디어 교류를 통해서 서로를 더욱 발전시킬 수 있다고 믿습니다. 넥슨네트웍스의 동료들과 함께 저의 열정과 에너지를 통해 협력적으로 일하며 오랫동안 함께하고 싶은 사람이 되고 싶습니다.
            </p>
          </fieldset>
        </div>
      </table>

      <table>
        <div class ="division">
          <fieldset>
            <legend>지금까지 플레이한 게임 중에서 가장 자신 있거나 오래 플레이한 게임의 레벨 및 티어, 플레이 기간, 인상 깊은 콘텐츠에 대해서 작성해주세요.</legend>
            <p>
            제가 가장 오래 플레이한 게임은 "메이플스토리"입니다. 초등학교 때부터 시작한 메이플스토리와의 인연은 지금까지도 이어져 오고 있습니다.<br/>
            제가 육성 중인 캐릭터의 레벨은 275이며, 저는 메이플스토리의 귀여운 도트 그래픽과 게임의 이야기들이 인상 깊었습니다. 그중에서 차원의 도서관이라는 콘텐츠가 가장 인상 깊었습니다. 왜냐하면 여러 가지 이야기를 게임이라는 수단으로써 잘 풀어냈다고 생각했기 때문입니다.<br/>
            차원의 도서관에서는 이야기 속의 주인공을 유저가 직접 플레이함으로써 책을 읽거나 영화를 보는 것과는 다른 색다른 방법으로 메이플 월드에서 일어났던 중요한 사건을 직접 체험할 수 있다는 점이 인상 깊었습니다. 그렇기에 저도 이 콘텐츠를 즐길 때 정말 그 캐릭터가 된 것처럼 몰입하여 즐겼으며, 메이플스토리를 한층 더 재밌게 즐길 수 있었던 좋은 경험이었습니다. 
            </p>
          </fieldset>
          </div>
      </table>
    </div>
  );
};

export default SelfIntro;